Documents/ОтражениеУдержанногоНДФЛВБухучете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОтражениеУдержанногоНДФЛВБухучете</Name>
			<Comment>АПК:93 Представления объекта и списка совпадают с синонимом</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтражениеВБухучетеУдержанныйНДФЛ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Comment>АПК:58 </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдержанныйНДФЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КБК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодНалоговогоОргана</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПоОКТМО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПеречисленияНалога</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУдержания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяФинансирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОтражениеВБухучетеУдержанныйНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОтражениеВБухучетеУдержанныйНДФЛ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПеречисленияНалога</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУдержания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОтражениеУдержанногоНДФЛВБухучете/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПодготовитьДанныеДляЗаполнения", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_ОтражениеУдержанногоНДФЛ";
	КомандаПечати.Представление = НСтр("ru = 'Отражение удержанного НДФЛ в бухучете'");
	КомандаПечати.МенеджерПечати = "Документ.ОтражениеУдержанногоНДФЛВБухучете";
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ОтражениеУдержанногоНДФЛ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПФ_MXL_ОтражениеУдержанногоНДФЛ",
			НСтр("ru = 'Отражение удержанного НДФЛ в бухучете'"),
			ПечатьОтражениеУдержанногоНДФЛ(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.ОтражениеУдержанногоНДФЛВБухучете.ПФ_MXL_ОтражениеУдержанногоНДФЛ");
			
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьОтражениеУдержанногоНДФЛ(МассивОбъектов, ОбъектыПечати)
	
	РаботаВБюджетномУчреждении = ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Если РаботаВБюджетномУчреждении Тогда
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтражениеУдержанногоНДФЛВБухучете_ОтражениеУдержанногоНДФЛПоСтатьям";
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтражениеУдержанногоНДФЛВБухучете.ПФ_MXL_ОтражениеУдержанногоНДФЛПоСтатьям");
	Иначе
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтражениеУдержанногоНДФЛВБухучете_ОтражениеУдержанногоНДФЛ";
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтражениеУдержанногоНДФЛВБухучете.ПФ_MXL_ОтражениеУдержанногоНДФЛ");
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УдержанныйНДФЛ.Ссылка.Организация.НаименованиеПолное КАК НазваниеОрганизации,
	|	УдержанныйНДФЛ.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	УдержанныйНДФЛ.Ссылка.Дата КАК Дата,
	|	УдержанныйНДФЛ.Ссылка.Номер КАК Номер,
	|	УдержанныйНДФЛ.Ссылка КАК Ссылка,
	|	УдержанныйНДФЛ.НомерСтроки КАК НомерСтроки,
	|	УдержанныйНДФЛ.КБК КАК КБК,
	|	УдержанныйНДФЛ.КодНалоговогоОргана КАК КодНалоговогоОргана,
	|	УдержанныйНДФЛ.КодПоОКТМО КАК КодПоОКТМО,
	|	УдержанныйНДФЛ.КПП КАК КПП,
	|	УдержанныйНДФЛ.ДатаУдержания КАК ДатаУдержания,
	|	УдержанныйНДФЛ.СрокПеречисленияНалога КАК СрокПеречисленияНалога,
	|	УдержанныйНДФЛ.СтатьяФинансирования КАК СтатьяФинансирования,
	|	УдержанныйНДФЛ.СтатьяРасходов КАК СтатьяРасходов,
	|	УдержанныйНДФЛ.Сумма КАК Сумма
	|ИЗ
	|	Документ.ОтражениеУдержанногоНДФЛВБухучете.УдержанныйНДФЛ КАК УдержанныйНДФЛ
	|ГДЕ
	|	УдержанныйНДФЛ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	УдержанныйНДФЛ.НомерСтроки";

	Выборка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	ДанныеСтроки = Новый Структура("Номер,КБК,КодНалоговогоОргана,КодПоОКТМО,КПП,ДатаУдержания,СрокПеречисленияНалога,СтатьяФинансирования,СтатьяРасходов,Сумма");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ЗаполнятьДатуУдержания = ЗаполнятьДатуУдержания(Выборка);
		Если ЗаполнятьДатуУдержания Тогда
			ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
			ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
			ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
		Иначе
			ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка1");
			ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка1");
			ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал1");
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок.Параметры.НазваниеОрганизации 	= Выборка.НазваниеОрганизации;
		ОбластьЗаголовок.Параметры.ПериодРегистрации 	= Формат(Выборка.ПериодРегистрации,"ДФ='ММMM yyyy'");
		ОбластьЗаголовок.Параметры.ДатаДокумента 		= Формат(Выборка.Дата, "ДЛФ=D");
		ОбластьЗаголовок.Параметры.НомерДокумента 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина);

		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		Итог = 0;
		
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			ДанныеСтроки.Номер 					= Выборка.НомерСтроки;
			ДанныеСтроки.КБК 					= Выборка.КБК;
			ДанныеСтроки.КодНалоговогоОргана 	= Выборка.КодНалоговогоОргана;
			ДанныеСтроки.КодПоОКТМО 			= Выборка.КодПоОКТМО;
			ДанныеСтроки.КПП 					= Выборка.КПП;
			ДанныеСтроки.СрокПеречисленияНалога = Формат(Выборка.СрокПеречисленияНалога, "ДФ=dd.MM.yyyy");
			ДанныеСтроки.Сумма 					= Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2");
			Если ЗаполнятьДатуУдержания Тогда
				ДанныеСтроки.ДатаУдержания = Формат(Выборка.ДатаУдержания, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			Если РаботаВБюджетномУчреждении Тогда
				ДанныеСтроки.СтатьяФинансирования 	= Выборка.СтатьяФинансирования;
				ДанныеСтроки.СтатьяРасходов 		= Выборка.СтатьяРасходов;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ДанныеСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			Итог = Итог + Выборка.Сумма;
		КонецЦикла;
		
		ОбластьПодвал.Параметры.Сумма = Формат(Итог, "ЧЦ=15; ЧДЦ=2");
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

Процедура ПодготовитьДанныеДляЗаполнения(ПараметрыДляЗаполнения, АдресХранилища) Экспорт

	УдержанныйНДФЛ = ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраНакопления("ОтражениеВБухучетеУдержанныйНДФЛ"); 
	Если Не ПараметрыДляЗаполнения.ЗаполнятьДатуУдержания Тогда
		УдержанныйНДФЛ.Колонки.Удалить("ДатаУдержания");
	КонецЕсли;
	
	Организация 	 	= ПараметрыДляЗаполнения.Организация;
	ДокументСсылка 		= ПараметрыДляЗаполнения.ДокументСсылка;
	ДатаНачала 			= ПараметрыДляЗаполнения.ДатаНачала;
	ДатаОкончания 		= ПараметрыДляЗаполнения.ДатаОкончания;
	
	УдержанныйНалог = УчетНДФЛ.УдержаноНалогаЗаПериод(Организация, ДатаНачала, ДатаОкончания);
	
	РегистрацииИФНС = ОбщегоНазначения.ВыгрузитьКолонку(УдержанныйНалог, "РегистрацияВНалоговомОргане", Истина);
	СвойстваРегистраций = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(РегистрацииИФНС,"КодПоОКТМО,КПП,Код");
	
	Для каждого СтрокаТЗ Из УдержанныйНалог Цикл
		НоваяСтрока = УдержанныйНДФЛ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		Если ЗначениеЗаполнено(СтрокаТЗ.РегистрацияВНалоговомОргане) Тогда
			РеквизитыРегистрации 	= СвойстваРегистраций[СтрокаТЗ.РегистрацияВНалоговомОргане];
			НоваяСтрока.КодПоОКТМО 	= РеквизитыРегистрации.КодПоОКТМО;
			НоваяСтрока.КПП 		= РеквизитыРегистрации.КПП;
			НоваяСтрока.КодНалоговогоОргана = РеквизитыРегистрации.Код;
		КонецЕсли;
	КонецЦикла;
	
	КолонкиСуммирования = "КБК,КодНалоговогоОргана,КодПоОКТМО,КПП,СрокПеречисленияНалога";
	Если ПараметрыДляЗаполнения.ЗаполнятьДатуУдержания Тогда
		КолонкиСуммирования = СтрШаблон("%1,%2", КолонкиСуммирования, "ДатаУдержания");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
		КолонкиСуммирования = СтрШаблон("%1,%2", КолонкиСуммирования, "СтатьяФинансирования,СтатьяРасходов")
	КонецЕсли;
	УдержанныйНДФЛ.Свернуть(КолонкиСуммирования, "Сумма");
	
	// Таблицы в данных заполнения содержат различные вспомогательные колонки.
	// Приведем структуру таблиц к структуре табличных частей документа. 
	РезультатЗаполнения = Новый Структура("УдержанныйНДФЛ", УдержанныйНДФЛ);
	ОтражениеЗарплатыВБухучете.ПривестиРезультатыЗаполненияКСтруктуреТаблицДокумента(РезультатЗаполнения, ДокументСсылка);
	
	ВычестьУжеЗарегистрированныеДанные(РезультатЗаполнения.УдержанныйНДФЛ, ПараметрыДляЗаполнения);
	
	КолонкиСортировки = 
	"КБК,
	|КодНалоговогоОргана,
	|КодПоОКТМО,
	|КПП,
	|ДатаУдержания,
	|СрокПеречисленияНалога,
	|СтатьяФинансирования,
	|СтатьяРасходов,
	|Сумма";
	РезультатЗаполнения.УдержанныйНДФЛ.Сортировать(КолонкиСортировки, Новый СравнениеЗначений);
	
	ПоместитьВоВременноеХранилище(РезультатЗаполнения.УдержанныйНДФЛ, АдресХранилища);
	
КонецПроцедуры

Функция ПериодыЗаполнения(Период, ДатаДокумента, ПередаватьЧастичныеУведомленийПоНДФЛ) Экспорт

	ПериодыЗаполнения = Новый Структура("ДатаНачала,ДатаОкончания");
	ЧастичноеУведомление = (ПередаватьЧастичныеУведомленийПоНДФЛ И Месяц(Период) = Месяц(ДатаДокумента) И День(ДатаДокумента)<=12);
	
	Если Период >= УчетНДФЛ.ДатаИзмененияСроковУплатыНалога() Или Период < Дата(2023,1,1) Тогда
		ПериодыЗаполнения.ДатаНачала 	= НачалоМесяца(Период);
		ПериодыЗаполнения.ДатаОкончания = КонецМесяца(Период);
	Иначе
		НомерГода  = Год(Период);
		НомерМесяца = Месяц(Период);
		Если НомерМесяца = 1 Тогда
			ПериодыЗаполнения.ДатаНачала 	= Дата(НомерГода,НомерМесяца,1);
			ПериодыЗаполнения.ДатаОкончания = Дата(НомерГода,НомерМесяца,22);
		ИначеЕсли НомерМесяца = 12 Тогда
			ПериодыЗаполнения.ДатаНачала 	= Дата(НомерГода,НомерМесяца-1,23);
			Если ЧастичноеУведомление Тогда
				ПериодыЗаполнения.ДатаОкончания = Дата(НомерГода,НомерМесяца,9);
			Иначе
				ПериодыЗаполнения.ДатаОкончания = Дата(НомерГода,НомерМесяца,31);
			КонецЕсли;
		Иначе
			ПериодыЗаполнения.ДатаНачала 	= Дата(НомерГода,НомерМесяца-1,23);
			Если ЧастичноеУведомление Тогда
				ПериодыЗаполнения.ДатаОкончания = Дата(НомерГода,НомерМесяца,9);
			Иначе
				ПериодыЗаполнения.ДатаОкончания = Дата(НомерГода,НомерМесяца,22);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПериодыЗаполнения;

КонецФункции

// Вычисляет необходимость заполнения даты удержания.
//
// Параметры:
// 		Объект - Струкутра, ДокументОбъект.ОтражениеУдержанногоНДФЛВБухучете - если структура, то содержит свойства: ПериодРегистрации,Дата.
//
// Возвращаемое значение:
//		Булево.
//
Функция ЗаполнятьДатуУдержания(Объект) Экспорт
	
	ЗаполнятьДатуУдержания = Ложь;
	
	ЗаполнятьДатуУдержания = (Объект.ПериодРегистрации >= УчетНДФЛ.ДатаИзмененияСроковУплатыНалога());
	Если Не ЗаполнятьДатуУдержания Тогда
		НачалоПередачиЧастичныхУведомленийПоНДФЛ = УчетНДФЛ.НачалоПередачиЧастичныхУведомлений();
		Если ЗначениеЗаполнено(НачалоПередачиЧастичныхУведомленийПоНДФЛ) Тогда
			ЗаполнятьДатуУдержания = (Год(Объект.ПериодРегистрации) = 2023
				И Объект.ПериодРегистрации >= НачалоПередачиЧастичныхУведомленийПоНДФЛ
				И Объект.Дата >= НачалоПередачиЧастичныхУведомленийПоНДФЛ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗаполнятьДатуУдержания;
	
КонецФункции

Процедура ВычестьУжеЗарегистрированныеДанные(УдержанныйНДФЛ, ПараметрыДляЗаполнения)
	
	Организация 	 		= ПараметрыДляЗаполнения.Организация;
	ПериодРегистрации 		= ПараметрыДляЗаполнения.ПериодРегистрации;
	ИсключаемыйРегистратор 	= ПараметрыДляЗаполнения.ДокументСсылка;
	ДатаОкончания 			= ПараметрыДляЗаполнения.ДатаОкончания;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ИмяПоля КАК ИмяПоля
	|ИЗ
	|	РегистрНакопления.ОтражениеВБухучетеУдержанныйНДФЛ КАК Таблица
	|ГДЕ
	|	Таблица.Организация = &Организация
	|	И Таблица.Период = &ПериодРегистрации
	|	И Таблица.Регистратор <> &ИсключаемыйРегистратор
	|	И Таблица.ДатаУдержания <= &ДатаОкончания";
	
	ПоляЗапроса = Новый Массив;
	Для каждого КолонкаТЗ Из УдержанныйНДФЛ.Колонки Цикл
		ИмяПоля = КолонкаТЗ.Имя;
		Если КолонкаТЗ.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			ПоляЗапроса.Добавить("-Таблица." + ИмяПоля + " КАК " + ИмяПоля);
		Иначе
			ПоляЗапроса.Добавить("Таблица." + ИмяПоля + " КАК " + ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	ПоляЗапроса = СтрСоединить(ПоляЗапроса, "," + Символы.ПС);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,  "&ИмяПоля КАК ИмяПоля",  ПоляЗапроса);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(УдержанныйНДФЛ.Добавить(), Выборка);
	КонецЦикла; 
	
	ОтражениеЗарплатыВУчете.СвернутьТаблицу(УдержанныйНДФЛ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
